---
kind: method
id: M:Autodesk.Revit.DB.FilterNumericGreater.#ctor
source: html/b0df2a59-dff8-b634-758e-2da66d13e802.htm
---
# Autodesk.Revit.DB.FilterNumericGreater.#ctor Method

Constructs an instance of FilterNumericGreater.

## Syntax (C#)
```csharp
public FilterNumericGreater()
```